{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_11",
    "layers": [
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_50",
          "trainable": true,
          "batch_input_shape": [
            null,
            4,
            64,
            1
          ],
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            4,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_51",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            1,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_29",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            1,
            2
          ],
          "padding": "valid",
          "strides": [
            1,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_52",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            1,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_53",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            1,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_30",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            1,
            2
          ],
          "padding": "valid",
          "strides": [
            1,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_54",
          "trainable": true,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            1,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_31",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            1,
            2
          ],
          "padding": "valid",
          "strides": [
            1,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten_11",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_22",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_23",
          "trainable": true,
          "dtype": "float32",
          "units": 5,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      }
    ]
  },
  "keras_version": "2.2.4-tf",
  "backend": "tensorflow"
}